logs/fio/mdev/2S2F/4KRandW12_s2_q4_1_v0_mdev.log
randw-4K-n1-c1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
randw-4K-n2-c2: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n4-c4: (g=2): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n8-c8: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
randw-4K-n12-c12: (g=4): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.1
Starting 27 processes

randw-4K-n1-c1: (groupid=0, jobs=1): err= 0: pid=1264: Sun Jul 28 10:54:39 2019
  write: IOPS=123k, BW=481MiB/s (504MB/s)(56.3GiB/120001msec)
    slat (usec): min=2, max=109, avg= 2.78, stdev= 1.58
    clat (usec): min=15, max=729, avg=253.95, stdev=14.47
     lat (usec): min=18, max=737, avg=257.30, stdev=14.64
    clat percentiles (usec):
     | 10.000th=[  245], 20.000th=[  247], 30.000th=[  247], 40.000th=[  249],
     | 50.000th=[  249], 70.000th=[  253], 90.000th=[  273], 99.000th=[  310],
     | 99.900th=[  334], 99.990th=[  359], 99.999th=[  420]
   bw (  KiB/s): min=367517, max=475648, per=78.39%, avg=385963.00, stdev=6091.20, samples=239
   iops        : min=91879, max=118912, avg=96490.36, stdev=1522.82, samples=239
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=51.96%, 500=48.04%
  lat (usec)   : 750=0.01%
  cpu          : usr=50.23%, sys=49.77%, ctx=196, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,14771735,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n2-c2: (groupid=1, jobs=2): err= 0: pid=1307: Sun Jul 28 10:54:39 2019
  write: IOPS=232k, BW=906MiB/s (950MB/s)(106GiB/120012msec)
    slat (usec): min=2, max=23043, avg= 3.32, stdev= 5.82
    clat (usec): min=53, max=23460, avg=269.06, stdev=45.37
     lat (usec): min=74, max=23464, avg=272.98, stdev=45.77
    clat percentiles (usec):
     | 10.000th=[  253], 20.000th=[  260], 30.000th=[  262], 40.000th=[  265],
     | 50.000th=[  265], 70.000th=[  273], 90.000th=[  289], 99.000th=[  318],
     | 99.900th=[  334], 99.990th=[  355], 99.999th=[  709]
   bw (  KiB/s): min=355745, max=446050, per=39.19%, avg=363524.61, stdev=6449.53, samples=478
   iops        : min=88937, max=111512, avg=90880.75, stdev=1612.36, samples=478
  lat (usec)   : 100=0.01%, 250=4.80%, 500=95.20%, 750=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=49.22%, sys=50.74%, ctx=254, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,27831248,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n4-c4: (groupid=2, jobs=4): err= 0: pid=1312: Sun Jul 28 10:54:39 2019
  write: IOPS=281k, BW=1096MiB/s (1149MB/s)(128GiB/120012msec)
    slat (usec): min=2, max=24010, avg= 3.94, stdev=10.22
    clat (usec): min=25, max=48464, avg=449.25, stdev=103.01
     lat (usec): min=189, max=48468, avg=453.84, stdev=103.53
    clat percentiles (usec):
     | 10.000th=[  396], 20.000th=[  416], 30.000th=[  424], 40.000th=[  433],
     | 50.000th=[  445], 70.000th=[  469], 90.000th=[  506], 99.000th=[  570],
     | 99.900th=[  619], 99.990th=[  816], 99.999th=[19792]
   bw (  KiB/s): min=255096, max=377521, per=23.72%, avg=266275.93, stdev=9475.54, samples=956
   iops        : min=63774, max=94380, avg=66568.62, stdev=2368.90, samples=956
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.01%, 500=87.14%, 750=12.85%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=30.59%, sys=41.18%, ctx=17402435, majf=0, minf=32
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,33674503,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n8-c8: (groupid=3, jobs=8): err= 0: pid=1319: Sun Jul 28 10:54:39 2019
  write: IOPS=279k, BW=1090MiB/s (1143MB/s)(128GiB/120020msec)
    slat (usec): min=2, max=19996, avg= 3.78, stdev= 9.30
    clat (usec): min=135, max=22763, avg=910.37, stdev=96.38
     lat (usec): min=220, max=22769, avg=914.79, stdev=96.72
    clat percentiles (usec):
     | 10.000th=[  832], 20.000th=[  865], 30.000th=[  873], 40.000th=[  898],
     | 50.000th=[  906], 70.000th=[  938], 90.000th=[  996], 99.000th=[ 1074],
     | 99.900th=[ 1139], 99.990th=[ 2057], 99.999th=[11994]
   bw (  KiB/s): min=100790, max=263594, per=9.29%, avg=103752.33, stdev=7249.22, samples=1912
   iops        : min=25197, max=65898, avg=25937.71, stdev=1812.31, samples=1912
  lat (usec)   : 250=0.01%, 500=0.58%, 750=0.11%, 1000=91.03%
  lat (msec)   : 2=8.26%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=16.53%, sys=22.51%, ctx=25740433, majf=0, minf=67
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,33499092,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
randw-4K-n12-c12: (groupid=4, jobs=12): err= 0: pid=1331: Sun Jul 28 10:54:39 2019
  write: IOPS=279k, BW=1089MiB/s (1142MB/s)(128GiB/120026msec)
    slat (usec): min=2, max=26271, avg= 5.08, stdev=10.80
    clat (usec): min=70, max=28954, avg=1367.36, stdev=156.38
     lat (usec): min=237, max=28964, avg=1373.36, stdev=156.86
    clat percentiles (usec):
     | 10.000th=[ 1254], 20.000th=[ 1303], 30.000th=[ 1319], 40.000th=[ 1352],
     | 50.000th=[ 1369], 70.000th=[ 1418], 90.000th=[ 1483], 99.000th=[ 1860],
     | 99.900th=[ 2008], 99.990th=[ 2147], 99.999th=[ 4621]
   bw (  KiB/s): min=68352, max=157520, per=8.37%, avg=93378.84, stdev=8658.52, samples=2880
   iops        : min=17088, max=39380, avg=23344.49, stdev=2164.62, samples=2880
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.55%, 1000=2.59%
  lat (msec)   : 2=96.75%, 4=0.11%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=14.42%, sys=17.76%, ctx=13603195, majf=0, minf=97
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,33467340,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=481MiB/s (504MB/s), 481MiB/s-481MiB/s (504MB/s-504MB/s), io=56.3GiB (60.5GB), run=120001-120001msec

Run status group 1 (all jobs):
  WRITE: bw=906MiB/s (950MB/s), 906MiB/s-906MiB/s (950MB/s-950MB/s), io=106GiB (114GB), run=120012-120012msec

Run status group 2 (all jobs):
  WRITE: bw=1096MiB/s (1149MB/s), 1096MiB/s-1096MiB/s (1149MB/s-1149MB/s), io=128GiB (138GB), run=120012-120012msec

Run status group 3 (all jobs):
  WRITE: bw=1090MiB/s (1143MB/s), 1090MiB/s-1090MiB/s (1143MB/s-1143MB/s), io=128GiB (137GB), run=120020-120020msec

Run status group 4 (all jobs):
  WRITE: bw=1089MiB/s (1142MB/s), 1089MiB/s-1089MiB/s (1142MB/s-1142MB/s), io=128GiB (137GB), run=120026-120026msec

Disk stats (read/write):
  nvme0n1: ios=362/143182280, merge=0/0, ticks=28/90245624, in_queue=91935436, util=85.90%